The  WorksharedOperationProgressChangedEventArgs  type exposes the following members.
 Properties
Name  |   Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from  RevitAPIEventArgs  .)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  RevitAPIEventArgs  .)
Location
 Full path of the central model which is to be operated.
Status
 Get API event status, reflect current operation execution status.
 See Also
  WorksharedOperationProgressChangedEventArgs Class
  Autodesk.Revit.DB.Events Namespace